# _Recommerder Systems (Tavsiye Sistemleri) / Film Tavsiyesi_

In [1]:
import pandas as pd

# Veri manipülasyonu ve analiz için pandas kütüphanesini yüklüyoruz

In [10]:
ratings = pd.read_csv(
    'spark/spark/ml-100k/u.data', 
    sep='\t', 
    header=None, 
    names=['user_id', 'movie_id', 'rating'], 
    usecols=range(3)
)

# MovieLens veri setindeki kullanıcı-film puanlarını pandas DataFrame olarak okuyoruz

In [11]:
ratings

# DataFrame'i çağırarak kullanıcı-film puanlarını ve yapılarını görüntülüyoruz

        user_id  movie_id  rating
0             0        50       5
1             0       172       5
2             0       133       1
3           196       242       3
4           186       302       3
...         ...       ...     ...
99998       880       476       3
99999       716       204       5
100000      276      1090       1
100001       13       225       2
100002       12       203       3

[100003 rows x 3 columns]

In [17]:
movies = pd.read_csv(
    "spark/spark/ml-100k/u.item",
    encoding="iso-8859-1",
    sep="|",
    header=None,
    names=["movie_id", "title"],
    usecols=range(2)
)

# MovieLens veri setindeki film ID'leri ve isimlerini pandas DataFrame olarak okuyoruz

In [19]:
movies.head()

# DataFrame'in ilk 5 satırını görüntüleyerek film ID ve isimlerini hızlıca inceliyoruz

   movie_id              title
0         1   Toy Story (1995)
1         2   GoldenEye (1995)
2         3  Four Rooms (1995)
3         4  Get Shorty (1995)
4         5     Copycat (1995)

In [20]:
user = pd.read_csv(
    'spark/spark/ml-100k/u.user', 
    sep='|', 
    header=None, 
    names=['user_id', 'Age', 'Gender', 'Profession', 'Zipcode']
)

# MovieLens veri setindeki kullanıcı bilgilerini pandas DataFrame olarak okuyoruz

In [21]:
user.head()

# DataFrame'in ilk 5 satırını görüntüleyerek kullanıcı bilgilerini hızlıca inceliyoruz

   user_id  Age Gender  Profession Zipcode
0        1   24      M  technician   85711
1        2   53      F       other   94043
2        3   23      M      writer   32067
3        4   24      M  technician   43537
4        5   33      F       other   15213

In [23]:
rating = pd.merge(movies, ratings)

# Film isimleri ve kullanıcı puanlarını tek bir DataFrame'de birleştiriyoruz

In [24]:
rating.head()

# Birleştirilmiş DataFrame'in ilk 5 satırını görüntüleyerek kullanıcı-film-puan ilişkisini inceliyoruz

   movie_id             title  user_id  rating
0         1  Toy Story (1995)      308       4
1         1  Toy Story (1995)      287       5
2         1  Toy Story (1995)      148       4
3         1  Toy Story (1995)      280       4
4         1  Toy Story (1995)       66       3

In [28]:
# rating=pd.merge(rating,user)

In [29]:
# rating.head()

In [30]:
rating.title.value_counts()

# Her filmin kaç kez oy aldığını sayarak popülerliklerini kontrol ediyoruz

title
Star Wars (1977)                 583
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
                                ...
Someone Else's America (1995)      1
Dadetown (1995)                    1
He Walked by Night (1948)          1
Angela (1995)                      1
Hana-bi (1997)                     1
Name: count, Length: 1664, dtype: int64

In [31]:
import numpy as np

# Sayısal işlemler ve diziler için NumPy kütüphanesini yüklüyoruz

In [33]:
mg = rating.groupby('title').agg({'rating': [np.size, np.sum, np.mean]})

# Her film için oy sayısı, toplam puan ve ortalama puanı hesaplayarak özet istatistikler oluşturuyoruz

C:\Users\13tua\AppData\Local\Temp\ipykernel_5112\561543639.py:1: FutureWarning: The provided callable <function sum at 0x000001FD398A6200> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  mg=rating.groupby('title').agg({'rating':[np.size,np.sum,np.mean]})
C:\Users\13tua\AppData\Local\Temp\ipykernel_5112\561543639.py:1: FutureWarning: The provided callable <function mean at 0x000001FD398A7600> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  mg=rating.groupby('title').agg({'rating':[np.size,np.sum,np.mean]})

In [34]:
mg

# Film bazlı özet istatistikleri görüntüleyerek oy sayısı, toplam puan ve ortalama puan bilgilerini inceliyoruz

                                      rating
                                        size  sum      mean
title
'Til There Was You (1997)                  9   21  2.333333
1-900 (1994)                               5   13  2.600000
101 Dalmatians (1996)                    109  317  2.908257
12 Angry Men (1957)                      125  543  4.344000
187 (1997)                                41  124  3.024390
...                                      ...  ...       ...
Young Guns II (1990)                      44  122  2.772727
Young Poisoner's Handbook, The (1995)     41  137  3.341463
Zeus and Roxanne (1997)                    6   13  2.166667
unknown                                    9   31  3.444444
Á köldum klaka (Cold Fever) (1994)         1    3  3.000000

[1664 rows x 3 columns]

In [35]:
pm = mg.sort_values(('rating', 'mean'), ascending=False)

# Filmleri ortalama puana göre azalan sırada sıralayarak en yüksek puanlı filmleri belirliyoruz

In [36]:
pm

# Ortalama puana göre sıralanmış film istatistiklerini görüntüleyerek en beğenilen filmleri inceliyoruz

                                                   rating
                                                     size sum mean
title
Aiqing wansui (1994)                                    1   5  5.0
Someone Else's America (1995)                           1   5  5.0
Star Kid (1997)                                         3  15  5.0
Entertaining Angels: The Dorothy Day Story (1996)       1   5  5.0
Saint of Fort Washington, The (1993)                    2  10  5.0
...                                                   ...  ..  ...
New Age, The (1994)                                     1   1  1.0
Very Natural Thing, A (1974)                            1   1  1.0
Vermont Is For Lovers (1992)                            1   1  1.0
Death in the Garden (Mort en ce jardin, La) (1956)      1   1  1.0
3 Ninjas: High Noon At Mega Mountain (1998)             5   5  1.0

[1664 rows x 3 columns]

In [37]:
gs = pm['rating']['sum'].sum()

# Tüm filmlerin aldığı toplam puan sayısını hesaplıyoruz

In [39]:
pm['percentage']=pm['rating']['sum'].div(gs)*100

In [40]:
gs

np.int64(352986)

In [41]:
pm.head()

                                                  rating          percentage
                                                    size sum mean
title
Aiqing wansui (1994)                                   1   5  5.0   0.001416
Someone Else's America (1995)                          1   5  5.0   0.001416
Star Kid (1997)                                        3  15  5.0   0.004249
Entertaining Angels: The Dorothy Day Story (1996)      1   5  5.0   0.001416
Saint of Fort Washington, The (1993)                   2  10  5.0   0.002833

In [43]:
pm['rank']=pm['percentage'].rank(ascending=False)

In [44]:
pm.sort_values(by='rank',ascending=True)

                               rating                 percentage    rank
                                 size   sum      mean
title
Star Wars (1977)                  583  2541  4.358491   0.719859     1.0
Fargo (1996)                      508  2111  4.155512   0.598041     2.0
Return of the Jedi (1983)         507  2032  4.007890   0.575660     3.0
Contact (1997)                    509  1936  3.803536   0.548464     4.0
Raiders of the Lost Ark (1981)    420  1786  4.252381   0.505969     5.0
...                               ...   ...       ...        ...     ...
Hungarian Fairy Tale, A (1987)      1     1  1.000000   0.000283  1636.0
Hedd Wyn (1992)                     1     1  1.000000   0.000283  1636.0
New Age, The (1994)                 1     1  1.000000   0.000283  1636.0
Office Killer (1997)                1     1  1.000000   0.000283  1636.0
Mostro, Il (1994)                   1     1  1.000000   0.000283  1636.0

[1664 rows x 5 columns]

_Bu projede en populer filmleri bulup tavsiye ettik_